src/Enums/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Миллиметр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сантиметр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Метр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ИнициализацияНаСервере/Ext/Module.bsl
// Управление инициализацией приложения во время запуска.
//
Процедура ВыполнитьИнициализацию() Экспорт

	ИнициализацияЕдиницИзмерения();

КонецПроцедуры // ВыполнитьИнициализацию
 

// Выполняет инициализацию единиц измерения при первом запуске
// или в случае, если настройки приложения были сброшены.
//
Процедура ИнициализацияЕдиницИзмерения()

	// Проверка единиц ширины
	//
	ЕдШирины = Константы.ЕдиницаШирины.Получить();
	Если ЕдШирины = Неопределено ИЛИ ЕдШирины = Перечисления.ЕдиницыИзмерения.ПустаяСсылка() Тогда
		Константы.ЕдиницаШирины.Установить(Перечисления.ЕдиницыИзмерения.Миллиметр);
	КонецЕсли;
	
	
	// Проверка единиц высоты
	//
	ЕдВысоты = Константы.ЕдиницаВысоты.Получить();
	Если ЕдВысоты = Неопределено ИЛИ ЕдВысоты = Перечисления.ЕдиницыИзмерения.ПустаяСсылка() Тогда
		Константы.ЕдиницаВысоты.Установить(Перечисления.ЕдиницыИзмерения.Миллиметр);
	КонецЕсли;
	
	
	// Проверка единиц длины
	//
	ЕдДлины = Константы.ЕдиницаДлины.Получить();
	Если ЕдДлины = Неопределено ИЛИ ЕдДлины = Перечисления.ЕдиницыИзмерения.ПустаяСсылка() Тогда
		Константы.ЕдиницаДлины.Установить(Перечисления.ЕдиницыИзмерения.Метр);
	КонецЕсли;

КонецПроцедуры // ИнициализацияЕдиницИзмерения
